name: "Microsoft XDR"
query: |
  rename EventTime:=this["Event Time"],MachineId:=this["Machine Id"],ComputerName:=this["Computer Name"],RemoteComputerName:=this["Remote Computer Name"],InitiatingProcessCommandLine:=this["Initiating Process Command Line"], ProcessCreationTime:=this["Process Creation Time"], ProcessCommandLine:=this["Process Command Line"],InitiatingProcessAccountSid:=this["Initiating Process Account Sid"], Timestamp:=this["Timestamp"], DeviceId:=this["Device Id"], DeviceName:=this["Device Name"], ActionType:=this["Action Type"], FileName:=this["File Name"], FolderPath:=this["Folder Path"], SHA1:=this["SHA1"], SHA256:=this["SHA256"], MD5:=this["MD5"], FileSize:=this["File Size"], ProcessVersionInfoCompanyName:=this["Process Version Info Company Name"], ProcessVersionInfoProductName:=this["Process Version Info Product Name"], ProcessVersionInfoProductVersion:=this["Process Version Info Product Version"], ProcessVersionInfoInternalFileName:=this["Process Version Info Internal File Name"], ProcessVersionInfoOriginalFileName:=this["Process Version Info Original File Name"], ProcessVersionInfoFileDescription:=this["Process Version Info File Description"], ProcessId:=this["Process Id"], ProcessIntegrityLevel:=this["Process Integrity Level"], ProcessTokenElevation:=this["Process Token Elevation"], AccountDomain:=this["Account Domain"], AccountName:=this["Account Name"], AccountSid:=this["Account SID"], AccountUpn:=this["Account UPN"], AccountObjectId:=this["Account Object Id"], LogonId:=this["Logon Id"], InitiatingProcessAccountDomain:=this["Initiating Process Account Domain"], InitiatingProcessAccountName:=this["Initiating Process Account Name"], InitiatingProcessAccountSid:=this["Initiating Process Account SID"], InitiatingProcessAccountUpn:=this["Initiating Process Account UPN"], InitiatingProcessAccountObjectId:=this["Initiating Process Account Object Id"], InitiatingProcessLogonId:=this["Initiating Process Logon Id"], InitiatingProcessIntegrityLevel:=this["Initiating Process Integrity Level"], InitiatingProcessTokenElevation:=this["Initiating Process Token Elevation"], InitiatingProcessSHA1:=this["Initiating Process SHA1"], InitiatingProcessSHA256:=this["Initiating Process SHA256"], InitiatingProcessMD5:=this["Initiating Process MD5"], InitiatingProcessFileName:=this["Initiating Process File Name"], InitiatingProcessFileSize:=this["Initiating Process File Size"], InitiatingProcessVersionInfoCompanyName:=this["Initiating Process Version Info Company Name"], InitiatingProcessVersionInfoProductName:=this["Initiating Process Version Info Product Name"], InitiatingProcessVersionInfoProductVersion:=this["Initiating Process Version Info Product Version"], InitiatingProcessVersionInfoInternalFileName:=this["Initiating Process Version Info Internal File Name"], InitiatingProcessVersionInfoOriginalFileName:=this["Initiating Process Version Info Original File Name"], InitiatingProcessVersionInfoFileDescription:=this["Initiating Process Version Info File Description"], InitiatingProcessId:=this["Initiating Process Id"], InitiatingProcessCreationTime:=this["Initiating Process Creation Time"], InitiatingProcessFolderPath:=this["Initiating Process Folder Path"], InitiatingProcessParentId:=this["Initiating Process Parent Id"], InitiatingProcessParentFileName:=this["Initiating Process Parent File Name"], InitiatingProcessParentCreationTime:=this["Initiating Process Parent Creation Time"], InitiatingProcessSignerType:=this["Initiating Process Signer Type"], InitiatingProcessSignatureStatus:=this["Initiating Process Signature Status"], ReportId:=this["Report Id"], AppGuardContainerId:=this["App Guard Container Id"], AdditionalFields:=this["Additional Fields"], InitiatingProcessSessionId:=this["Initiating Process Session Id"], IsInitiatingProcessRemoteSession:=this["Is Initiating Process Remote Session"], InitiatingProcessRemoteSessionDeviceName:=this["Initiating Process Remote Session Device Name"], InitiatingProcessRemoteSessionIP:=this["Initiating Process Remote Session IP"], CreatedProcessSessionId:=this["Created Process Session Id"], IsProcessRemoteSession:=this["Is Process Remote Session"], ProcessRemoteSessionDeviceName:=this["Process Remote Session Device Name"], ProcessRemoteSessionIP:=this["Process Remote Session IP"], FileOriginUrl:=this["File Origin Url"], FileOriginReferrerUrl:=this["File Origin Referrer Url"], FileOriginIP:=this["File Origin IP"], PreviousFolderPath:=this["Previous Folder Path"], PreviousFileName:=this["Previous File Name"], RequestProtocol:=this["Request Protocol"], RequestSourceIP:=this["Request Source IP"], RequestSourcePort:=this["Request Source Port"], RequestAccountName:=this["Request Account Name"], RequestAccountDomain:=this["Request Account Domain"], RequestAccountSid:=this["Request Account SID"], ShareName:=this["Share Name"], SensitivityLabel:=this["Sensitivity Label"], SensitivitySubLabel:=this["Sensitivity Sub Label"], IsAzureInfoProtectionApplied:=this["Is Azure Info Protection Applied"], RemoteIP:=this["Remote IP"], RemotePort:=this["Remote Port"], RemoteUrl:=this["Remote Url"], LocalIP:=this["Local IP"], LocalPort:=this["Local Port"], Protocol:=this["Protocol"], LocalIPType:=this["Local IP Type"], RemoteIPType:=this["Remote IP Type"], RegistryKey:=this["Registry Key"], RegistryValueType:=this["Registry Value Type"], RegistryValueName:=this["Registry Value Name"], RegistryValueData:=this["Registry Value Data"], PreviousRegistryKey:=this["Previous Registry Key"], PreviousRegistryValueName:=this["Previous Registry Value Name"], PreviousRegistryValueData:=this["Previous Registry Value Data"], Application:=this["Application"], ApplicationId:=this["Application Id"], LogonType:=this["Logon Type"], ErrorCode:=this["Error Code"], CorrelationId:=this["Correlation Id"], SessionId:=this["Session Id"], AccountDisplayName:=this["Account Display Name"], IsExternalUser:=this["Is External User"], IsGuestUser:=this["Is Guest User"], AlternateSignInName:=this["Alternate Sign In Name"], LastPasswordChangeTimestamp:=this["Last Password Change Timestamp"], ResourceDisplayName:=this["Resource Display Name"], ResourceId:=this["Resource Id"], ResourceTenantId:=this["Resource Tenant Id"], AadDeviceId:=this["AAD Device Id"], OSPlatform:=this["OS Platform"], DeviceTrustType:=this["Device Trust Type"], IsManaged:=this["Is Managed"], IsCompliant:=this["Is Compliant"], AuthenticationProcessingDetails:=this["Authentication Processing Details"], AuthenticationRequirement:=this["Authentication Requirement"], TokenIssuerType:=this["Token Issuer Type"], RiskLevelAggregated:=this["Risk Level Aggregated"], RiskDetails:=this["Risk Details"], RiskState:=this["Risk State"], UserAgent:=this["User Agent"], ClientAppUsed:=this["Client App Used"], Browser:=this["Browser"], ConditionalAccessPolicies:=this["Conditional Access Policies"], ConditionalAccessStatus:=this["Conditional Access Status"], IPAddress:=this["IP Address"], Country:=this["Country"], State:=this["State"], City:=this["City"], Latitude:=this["Latitude"], Longitude:=this["Longitude"], NetworkLocationDetails:=this["Network Location Details"], RequestId:=this["Request Id"], AlertId:=this["Alert Id"], Title:=this["Title"], Categories:=this["Categories"], AttackTechniques:=this["Attack Techniques"], ServiceSource:=this["Service Source"], DetectionSource:=this["Detection Source"], EntityType:=this["Entity Type"], EvidenceRole:=this["Evidence Role"], EvidenceDirection:=this["Evidence Direction"], ThreatFamily:=this["Threat Family"], EmailSubject:=this["Email Subject"], OAuthApplicationId:=this["OAuth Application Id"], Severity:=this["Severity"], CloudResource:=this["Cloud Resource"], CloudPlatform:=this["Cloud Platform"], ResourceType:=this["Resource Type"], SubscriptionId:=this["Subscription Id"], IsAdminOperation:=this["Is Admin Operation"], DeviceType:=this["Device Type"], IsAnonymousProxy:=this["Is Anonymous Proxy"], CountryCode:=this["Country Code"], Isp:=this["Isp"], ActivityType:=this["Activity Type"], ActivityObjects:=this["Activity Objects"], ObjectName:=this["Object Name"], ObjectType:=this["Object Type"], ObjectId:=this["Object Id"], AccountType:=this["Account Type"], IsImpersonated:=this["Is Impersonated"], IPTags:=this["IP Tags"], IPCategory:=this["IP Category"], UserAgentTags:=this["User Agent Tags"], RawEventData:=this["Raw Event Data"], LastSeenForUser:=this["Last Seen For User"], UncommonForUser:=this["Uncommon For User"], AuditSource:=this["Audit Source"], SessionData:=this["Session Data"], OAuthAppId:=this["OAuth App Id"], ClientVersion:=this["Client Version"], PublicIP:=this["Public IP"], OSArchitecture:=this["OS Architecture"], OSBuild:=this["OS Build"], IsAzureADJoined:=this["Is Azure AD Joined"], JoinType:=this["Join Type"], LoggedOnUsers:=this["Logged On Users"], RegistryDeviceTag:=this["Registry Device Tag"], OSVersion:=this["OS Version"], MachineGroup:=this["Machine Group"], OnboardingStatus:=this["Onboarding Status"], DeviceCategory:=this["Device Category"], Model:=this["Model"], Vendor:=this["Vendor"], OSDistribution:=this["OS Distribution"], OSVersionInfo:=this["OS Version Info"], MergedDeviceIds:=this["Merged Device Ids"], MergedToDeviceId:=this["Merged To Device Id"], IsInternetFacing:=this["Is Internet Facing"], SensorHealthState:=this["Sensor Health State"], IsExcluded:=this["Is Excluded"], ExclusionReason:=this["Exclusion Reason"], ExposureLevel:=this["Exposure Level"], AssetValue:=this["Asset Value"], DeviceManualTags:=this["Device Manual Tags"], DeviceDynamicTags:=this["Device Dynamic Tags"], ConnectivityType:=this["Connectivity Type"], HostDeviceId:=this["Host Device Id"], AzureResourceId:=this["Azure Resource Id"], AwsResourceName:=this["Aws Resource Name"], GcpFullResourceName:=this["Gcp Full Resource Name"], InternetMessageId:=this["Internet Message Id"], SenderMailFromAddress:=this["Sender Mail From Address"], SenderFromAddress:=this["Sender From Address"], SenderDisplayName:=this["Sender Display Name"], SenderObjectId:=this["Sender Object Id"], SenderMailFromDomain:=this["Sender Mail From Domain"], SenderFromDomain:=this["Sender From Domain"], SenderIPv4:=this["Sender IPv4"], SenderIPv6:=this["Sender IPv6"], RecipientEmailAddress:=this["Recipient Email Address"], RecipientObjectId:=this["Recipient Object Id"], Subject:=this["Subject"], EmailClusterId:=this["Email Cluster Id"], EmailDirection:=this["Email Direction"], DeliveryAction:=this["Delivery Action"], DeliveryLocation:=this["Delivery Location"], ThreatTypes:=this["Threat Types"], ThreatNames:=this["Threat Names"], ConfidenceLevel:=this["Confidence Level"], BulkComplaintLevel:=this["Bulk Complaint Level"], EmailAction:=this["Email Action"], EmailActionPolicy:=this["Email Action Policy"], EmailActionPolicyGuid:=this["Email Action Policy Guid"], AuthenticationDetails:=this["authentication Details"], AttachmentCount:=this["Attachment Count"], UrlCount:=this["Url Count"], EmailLanguage:=this["Email Language"], Connectors:=this["Connectors"], OrgLevelAction:=this["Org Level Action"], OrgLevelPolicy:=this["Org Level Policy"], UserLevelAction:=this["User Level Action"], UserLevelPolicy:=this["User Level Policy"] | EventTime:=cast(EventTime, <time>),ProcessId:=cast(ProcessId, <string>), InitiatingProcessId:=cast(InitiatingProcessId, <string>) | fuse
inputFormat: "csv"
outputFormat: "zjson"
